package Seminar6.Seminar;

//Найти и исправить проблемные участки в закрепленном коде
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}
